[
  {
    "headings": [
      {
        "title": "## Overview",
        "description": "This project is a desktop application built using **NextronJS**, **ElectronJS**, and **TailwindCSS**, allowing users to generate professional README files for their projects with the help of various AI models such as OpenAI, Llama, Gemini, Claude, Perplexity, and more. Users can select their preferred AI model, provide their API keys, specify the project directory, and choose from a range of README templates. The AI will then generate a comprehensive README file based on the user's selections. Users can conveniently save the generated README file to their computer. \n"
      },
      {
        "title": "## Dependencies",
        "description": "The project requires the following dependencies:\n\n- NextronJS\n- ElectronJS\n- TailwindCSS\n- Openai API\n- Gemini API\n- Claude API\n- Llama API\n- Perplexity API \n"
      },
      {
        "title": "# Title",
        "description": "This is a desktop application where user can select from various ai models such as Openai, Llama, Gemini, Claude, Perplexity,  upon entering their apikeys, user can provide directory to their project, user can select from various templates present for readme then ai would do the job to build the readme out of it for the project, user can save the readme file on their computer aswell. The application is built using NextronJS, ElectronJS, TailwindCSS and utilizes APIs from Openai, Gemini, Claude, Llama and Perplexity to generate README files. \n"
      },
      {
        "title": "## Usage",
        "description": "1. Ensure all dependencies are installed. You can install all dependencies by running `npm install` in the project's root directory.\n2. Build the application by running `npm run build` in the project's root directory.\n3. Launch the application by running `npm run start` in the project's root directory. \n\nYou will be greeted with the OneAI application. \n4. Provide your API keys for various AI models like OpenAI, Llama, Gemini, Claude, Perplexity.\n5. Select the desired template for your README file.\n6. Provide the directory to your project.\n7. OneAI will generate the README file based on your selections and save it to your computer. You can edit and customize the generated README file as needed. \n"
      },
      {
        "title": "## License",
        "description": "This project is licensed under the [MIT License](https://opensource.org/licenses/MIT). Feel free to modify and distribute the code as per the terms of the license. \n"
      },
      {
        "title": "## Code Structure",
        "description": "The key components of the code include:\n\n- **UI:** The application's user interface is built using `NextronJS`, which leverages the power of `Next.js` for building web applications and integrates it with `ElectronJS` to create a native desktop application. The UI is styled using `TailwindCSS` for a modern and customizable look.\n- **AI Model Integration:**  The project seamlessly integrates with various leading AI models:\n    - **OpenAI API:** Users can leverage OpenAI's powerful models like GPT-3 and GPT-4 for advanced text generation and understanding.\n    - **Gemini API:** Access to Google's Gemini family of models, offering state-of-the-art performance for a range of tasks.\n    - **Claude API:** Utilize Anthropic's Claude, known for its safety and reliability in text generation and interaction.\n    - **Llama API:** Integrate with Meta's Llama models for large language model capabilities.\n    - **Perplexity API:** Connect to Perplexity AI, a powerful search engine and language model for information retrieval.\n- **API Key Management:**  Users can securely input their API keys for each model, allowing them to access and utilize the AI models within the application.\n- **Project Directory Integration:** The application enables users to provide the directory path to their projects, facilitating the automatic generation of READMEs based on the project's content and structure.\n- **Readme Template Selection:** Users can choose from a collection of pre-defined Readme templates, ensuring their Readme files adhere to best practices and conventions.\n- **Readme Generation:** The application leverages the selected AI model to automatically generate a high-quality Readme file based on the user's project directory and chosen template.\n- **Readme File Saving:** Users can conveniently save the generated Readme file to their computer for easy access and sharing. \n"
      },
      {
        "title": "## Folder Structure",
        "description": "- `.git`: Contains version control information for the project.\n- `chat_history.txt`: Stores the chat history between the user and the AI models.\n- `electron-builder.yml`: Configuration file for Electron Builder, used to package the application for different platforms.\n- `main`: Contains the main process code for the Electron application.\n    - `background.ts`: Handles background tasks and communication with the renderer process.\n    - `helpers`: Contains helper functions for creating windows and managing the application.\n        - `create-window.ts`: Creates the main application window.\n        - `index.ts`: Main helper functions file.\n    - `preload.ts`: Preload script injected into the renderer process to provide additional functionalities.\n- `package-lock.json`: Contains information about the project's dependencies and their versions.\n- `package.json`: The project's manifest file, defining dependencies, scripts, and other configuration.\n- `README.md`: This file, providing information about the project.\n- `renderer`: Contains the frontend code built with Next.js, Electron, and TailwindCSS.\n    - `.env.local`: Environment variables specific to the development environment.\n    - `components`: Contains reusable UI components.\n        - `Chat.tsx`: Component for displaying and managing the chat interface.\n    - `middleware.ts`: Middleware functions to handle requests and responses.\n    - `next-env.d.ts`: Type definitions for Next.js environment variables.\n    - `next.config.js`: Configuration file for Next.js, defining build settings and optimizations.\n    - `pages`: Contains the application's pages.\n        - `api`: Contains API routes for handling file operations and interacting with AI models.\n            - `readfile.ts`: Route for reading files from the user's project directory.\n            - `savefile.ts`: Route for saving the generated README file.\n            - `[model].ts`: Route for interacting with specific AI models based on the provided API keys.\n        - `home.tsx`: The main landing page of the application.\n        - `_app.tsx`: The application's main component.\n    - `postcss.config.js`: Configuration file for PostCSS, defining styling rules and plugins.\n    - `preload.d.ts`: Type definitions for the preload script.\n    - `public`: Contains static assets for the application.\n        - `images`: Contains images for the application.\n            - `logo.png`: The application's logo.\n        - `template.json`: Contains pre-defined README templates for users to select from.\n    - `styles`: Contains global styles for the application.\n        - `globals.css`: Global CSS styles.\n    - `tailwind.config.js`: Configuration file for TailwindCSS, defining the styling framework.\n    - `tsconfig.json`: TypeScript configuration file, defining compiler settings.\n- `resources`: Contains icons for the application.\n    - `icon.icns`: Icon for macOS.\n    - `icon.ico`: Icon for Windows.\n- `tsconfig.json`: TypeScript configuration file for the main process. \n"
      }
    ]
  }
]